code/org-project-manager.org
* Header :noexport:
:PROPERTIES:
#+TITLE: An emacs-org project manager for applied statisticians
#+EMAIL: tag@biostat.ku.dk
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc author:nil
#+LaTeX_HEADER:\usepackage{authblk}
#+LaTeX_HEADER:\usepackage{natbib}
#+LaTeX_HEADER:\usepackage[T1]{fontenc}
#+LaTeX_HEADER:\renewcommand*\familydefault{\sfdefault}
#+LaTeX_HEADER:\usepackage[table,usenames,dvipsnames]{xcolor}
#+LaTeX_HEADER:\definecolor{lightGray}{gray}{0.98}
#+LaTeX_HEADER:\definecolor{medioGray}{gray}{0.83}
#+LaTeX_HEADER:\rowcolors{1}{medioGray}{lightGray}
#+LaTeX_HEADER:\usepackage{attachfile}
#+LaTeX_HEADER:\usepackage{array}
#+LaTeX_HEADER:\author{Thomas Alexander Gerds}
#+LaTeX_HEADER:\affil{Department of Biostatistics, University of Copenhagen, Denmark}
#+LaTeX_HEADER:\author{Klaus K\"ahler Holst}
#+LaTeX_HEADER:\affil{Department of Biostatistics, University of Copenhagen, Denmark}
#+LaTeX_HEADER:\author{Jochen Knaus}
#+LaTeX_HEADER:\affil{Department of Medical Biometrie and Medical Informatics, University of Freiburg, Freiburg, Germany}
#+LaTeX_HEADER:\newcommand{\sfootnote}[1]{\renewcommand{\thefootnote}{\fnsymbol{footnote}}\footnote{#1}\setcounter{footnote}{0}\renewcommand{\thefootnote}{\arabic{foot note}}}
#+LaTeX_HEADER:\makeatletter\def\blfootnote{\xdef\@thefnmark{}\@footnotetext}\makeatother
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_HEADER \itemsep2pt
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+LaTeX_HEADER: \usepackage{color}
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER: keywordstyle=\color{blue},
#+LATEX_HEADER: commentstyle=\color{red},
#+LATEX_HEADER: stringstyle=\color[rgb]{0,.5,0},
#+LATEX_HEADER: basicstyle=\ttfamily\small,
#+LATEX_HEADER: columns=fullflexible,
#+LATEX_HEADER: breaklines=true,        % sets automatic line breaking
#+LATEX_HEADER: breakatwhitespace=false,    % sets if automatic breaks should only happen at whitespace
#+LATEX_HEADER: numbers=left,
#+LATEX_HEADER: numberstyle=\ttfamily\tiny\color{gray},
#+LATEX_HEADER: stepnumber=1,
#+LATEX_HEADER: numbersep=10pt,
#+LATEX_HEADER: backgroundcolor=\color{white},
#+LATEX_HEADER: tabsize=4,
#+LATEX_HEADER: showspaces=false,
#+LATEX_HEADER: showstringspaces=false,
#+LATEX_HEADER: xleftmargin=.23in,
#+LATEX_HEADER: frame=single,
#+LATEX_HEADER: basewidth={0.5em,0.4em}
#+LATEX_HEADER: }
#+PROPERTY: session *R* 
#+PROPERTY: cache yes
#+PROPERTY: colnames yes
:END:

* Introduction 

This document simulaneously describes and defines a project manager
for applied statistical workflows based on the fabulous and popular
emacs orgmode. Really it describes and automates one out of many
possibilities to customize orgmode.

* Project manager
** Setup and maintenance
*** The project manager file   
#+BEGIN_SRC emacs-lisp :export code
  (defvar org-project-manager (concat
                               (file-name-as-directory org-directory)
                                         "Projects.org")
              "Where the org-project-manager defines the projects. The contents of
          the file has the following structure:
          
      ,* Fun projects
       :PROPERTIES:
       :LOCATION: ~/fun
       :END:  
          
      ,**** Tex Avery Collection 
      :PROPERTIES:
      :index: bla.org
      :nickname: texAvery
      :collab: Foghorn Leghorn
      :END:
    
      ,**** Cultural stuff like films, tv-series, music etc.
      :PROPERTIES:
      :nickname: culture
      :END:
    
      ,* Work projects
       :PROPERTIES:
       :LOCATION: ~/work
       :END:    
    
    ,**** ACTIVE BinomialRegression
    :PROPERTIES:
    :NICKNAME: BinomialRegression
    :END:
      ")
#+END_SRC

#+BEGIN_SRC emacs-lisp :export code
(defvar org-project-manager-project-level 4
"Subheading level at which projects are defined
in `org-project-manager'.")
#+END_SRC

The project manager is in org-mode (major-mode). To change specific
keystrokes only in this file, the current solution is to put
a minor-mode on top of it.
    
#+BEGIN_SRC emacs-lisp :export code
  (defvar org-project-manager-minor-mode nil)
  (make-variable-buffer-local 'org-project-manager-minor-mode)
  (defvar org-project-manager-minor-mode-map (make-sparse-keymap)
    "Keymap used for `org-project-manager-minor-mode' commands.")
  (or (assq 'org-project-manager-minor-mode minor-mode-map-alist)
      (setq minor-mode-map-alist
            (append minor-mode-map-alist
                    (list (cons 'org-project-manager-minor-mode org-project-manager-minor-mode-map)))))
  (or (assq 'org-project-manager-minor-mode minor-mode-alist)
      (setq minor-mode-alist
            (cons '(org-project-manager-minor-mode " Project") minor-mode-alist)))
  (defun org-project-manager-minor-mode (&optional arg)
    "A minor mode for using org Project Manager."
    (interactive "P")
    ;; (make-variable-buffer-local 'hippie-expand-try-functions-list)
    (setq org-project-manager-minor-mode
          (not (or (and (null arg) org-project-manager-minor-mode)
                   (<= (prefix-numeric-value arg) 0)))))
  (define-key org-project-manager-minor-mode-map [(meta return)] 'org-project-manager-return)
  (add-hook 'find-file-hooks 
            (lambda ()
              (let ((file (buffer-file-name)))
                (when (and file (equal file (expand-file-name org-project-manager)))
                  (org-project-manager-minor-mode)))))
#+END_SRC
   
