code/org-project-manager.el

(defvar org-project-manager (concat
                             (file-name-as-directory org-directory)
                                       "Projects.org")
            "Where the org-project-manager defines the projects. The contents of
        the file has the following structure:
        
    ,* Fun projects
     :PROPERTIES:
     :LOCATION: ~/fun
     :END:  
        
    ,**** Tex Avery Collection 
    :PROPERTIES:
    :index: bla.org
    :nickname: texAvery
    :collab: Foghorn Leghorn
    :END:
  
    ,**** Cultural stuff like films, tv-series, music etc.
    :PROPERTIES:
    :nickname: culture
    :END:
  
    ,* Work projects
     :PROPERTIES:
     :LOCATION: ~/work
     :END:    
  
  ,**** ACTIVE BinomialRegression
  :PROPERTIES:
  :NICKNAME: BinomialRegression
  :END:
    ")

(defvar org-project-manager-project-level 4
"Subheading level at which projects are defined
in `org-project-manager'.")

(defvar org-project-manager-minor-mode nil)
(make-variable-buffer-local 'org-project-manager-minor-mode)
(defvar org-project-manager-minor-mode-map (make-sparse-keymap)
  "Keymap used for `org-project-manager-minor-mode' commands.")
(or (assq 'org-project-manager-minor-mode minor-mode-map-alist)
    (setq minor-mode-map-alist
          (append minor-mode-map-alist
                  (list (cons 'org-project-manager-minor-mode org-project-manager-minor-mode-map)))))
(or (assq 'org-project-manager-minor-mode minor-mode-alist)
    (setq minor-mode-alist
          (cons '(org-project-manager-minor-mode " Project") minor-mode-alist)))
(defun org-project-manager-minor-mode (&optional arg)
  "A minor mode for using org Project Manager."
  (interactive "P")
  ;; (make-variable-buffer-local 'hippie-expand-try-functions-list)
  (setq org-project-manager-minor-mode
        (not (or (and (null arg) org-project-manager-minor-mode)
                 (<= (prefix-numeric-value arg) 0)))))
(define-key org-project-manager-minor-mode-map [(meta return)] 'org-project-manager-return)
(add-hook 'find-file-hooks 
          (lambda ()
            (let ((file (buffer-file-name)))
              (when (and file (equal file (expand-file-name org-project-manager)))
                (org-project-manager-minor-mode)))))
