code/org-project-manager.el

(defvar org-project-manager-project-alist nil
        "Alist of projects associating the nickname of the project
  with information like the location of the project, the org-file, collaborators,
  index-file, category, publishing-directory, etc.")
  
    (defun org-project-manager-project-list ()
      "List the org-files assocated with the projects. "
      (interactive)
      (delq nil (mapcar '(lambda (x) (let ((f (org-project-manager-get-org x))) (if (file-exists-p f) f))) 
                        (org-project-manager-parse-projects))))
    
    (defun org-project-manager-list-projects (&optional class flag)
      (interactive)
      ;; (org-project-manager-parse-projects)
      (let* ((cl (or class (completing-read "Project class: " (org-project-manager-parse-categories))))
             (projects org-project-manager-project-alist))
        (delq nil (mapcar '(lambda (x)
                             (let ((org-file (org-project-manager-get-org x))) 
                             (if class
                                 (when (and (string= (org-project-manager-get-category x) class)
                                            org-file
                                            (file-exists-p org-file))
                                   org-file))))
                          projects))))
  

(defvar org-project-manager-include-keywords nil
    "Sub-list of the `org-todo-keywords' as defined locally
in the file `org-project-manager'.

If nil (the default) then all projects at the level
`org-project-manager-project-level' are added.

Otherwise, it should be a list of todo-keywords as they are
defined either globally or locally in the file
 `org-project-manager'
If matched with the todo-keyword of a project, i.e. a
level `org-project-manager-project-level' section heading
in `org-project-manager' is added to the
`org-project-manager-project-alist' during parsing.

For example, if set to 
(list \"ACTIVE\").
only ACTIVE projects are included.")

  (defun org-project-manager-project-include-p ()
    "For parsing of projects:
  
  Decides about whether or not the project is
  in included into the active project list.
  
  Compares the todo-keyword of the project description
  in `org-project-manager' with the value of
  `org-project-manager-include-keywords'. If matched
  the project is added to the `org-project-manager-project-alist'."
    (save-excursion
      (org-back-to-heading t)
      (and (looking-at org-todo-line-regexp)
           (match-end 2)
           (or (not org-project-manager-include-keywords)
           (member (org-match-string-no-properties 2)
                   org-project-manager-include-keywords)))))
  
    (defvar org-project-manager-include-keywords    '("ACTIVE")
      "Sub-list of the `org-todo-keywords' as defined locally
  in the file `org-project-manager'.
  
  If matched with the todo-keyword of a project, i.e. a
  level `org-project-manager-project-level' section heading
  in `org-project-manager' is added to the
  `org-project-manager-project-alist' during parsing. Defaults to
  \"ACTIVE\"."
  )
  
(defun org-project-manager-parse-projects (&optional all)
    "Parse file 'project-manager' and update 'org-project-manager-project-alist'"
    (interactive)
    (save-excursion
      (setq org-project-manager-project-alist nil)
      (set-buffer (find-file-noselect org-project-manager))
      (save-buffer)
      (goto-char (point-min))
      (while (re-search-forward (format "^\\*\\{%d\\} " org-project-manager-project-level) nil t)
        (when (or all (org-project-manager-project-include-p))
          (let* ((loc (org-entry-get nil "LOCATION" 'inherit))
                 (category (org-entry-get nil "CATEGORY" 'inherit))
               (collab (org-entry-get nil "COLLAB" nil))
               (publish-dir (org-entry-get nil "PUBLISH" 'inherit))
               (name (or (org-entry-get nil "NICKNAME" nil)
                         (nth 4 (org-heading-components))))
               (index (or (org-entry-get nil "INDEX" nil)
                          (let ((default-org-home
                                  (concat (file-name-as-directory loc)
                                          name
                                          org-project-manager-org-location)))
                            (make-directory default-org-home t)
                            (concat (file-name-as-directory default-org-home) name ".org"))))
               (org (or (org-entry-get nil "PROJECTORG")
                        (when (string= (file-name-extension index) "org")
                          index))))
          (unless (file-name-absolute-p index)
            (setq index
                  (expand-file-name (concat (file-name-as-directory loc) name "/" index))))
          ;; (if loc (concat (file-name-as-directory loc) name "/" index)))))
          (add-to-list 'org-project-manager-project-alist
                       (list name
                             (list (cons "location"  loc)
                             (cons "org-file" org)
                             (cons "index-file" index)
                             (cons "category" category)
                             (cons "collab" collab)
                             (cons "publish-directory" publish-dir)))))))
      org-project-manager-project-alist))

(defvar org-project-manager-current-project nil "The currently selected project.")

(defvar org-project-manager-org-location "/"
      "Relative to the project location this defines
the path to the index file of a project. If set to
'/org/' then the index file will be placed
in a subdirectory 'org' of the project directory.")

(setq org-project-manager-default-category "Miscellaneous")
(setq org-refile-targets (quote ((org-project-manager :maxlevel . 3) (nil :maxlevel . 2))))

(defun org-project-manager-set-nickname ()
  (interactive)
  (org-set-property
   "NICKNAME"
   (read-string "NickName for project: "
                (nth 4 (org-heading-components)))))

(add-to-list 'org-structure-template-alist
             '("p" "**** ACTIVE \n:PROPERTIES:\n:NICKNAME: \n:COLLAB: \n:CaptureDate: \n:END:"))
