code/org-project-manager.org
**** TODO The interactive approach     

#+BEGIN_SRC emacs-lisp :export code     
  (defun org-project-manager-new-project ()
    (interactive)
    (org-project-manager-parse-projects)
    (org-project-manager-parse-categories)
    (let* ((title (read-string "Project title (long name): "))
           (nickname (read-string
                      (concat "Nickname (default " title "): ") nil 'minibuffer-history title))
           (cat (completing-read
                 "Choose a category: "
                 org-project-manager-project-categories nil nil nil "New projects")))
      (find-file org-project-manager)
      (goto-char (point-min))
      (if (or (re-search-forward (concat ":" cat ":") nil t)
              (re-search-forward (concat "^**[ \t]+" cat) nil t)
              (re-search-forward "^**[ \t]+ New projects" nil t))
          (let
              ((org-insert-heading-respect-content t))
            (org-insert-subheading))
        (insert
         (make-string org-project-manager-project-level
                      (string-to-char "*"))
         " "
         title
         "\n:PROPERTIES:\n:NICKNAME: "
         nickname
         "\n:END:\n")
        (org-set-tags-to "active"))))
#+END_SRC

#+BEGIN_SRC  emacs-lisp :export code
(setq org-project-manager-default-project-content "")
(defvar org-project-manager-default-project-ignore "
export
*.html
*.pdf
*.png
")     
(defvar org-project-manager-project-directories '("analysis" "org" "data" "email" "export" "misc" "presentation" "manuscript"))

(defun org-project-manager-template (directory projectname)
  "Generate project skeleton"
   (interactive "DDirectory: 
sProject-name (short): ")
   (let* (my-project-cd my-proj-path my-proj-file)
     (setq my-proj-path (concat directory "/" projectname "/"))
     (setq my-proj-cd (concat "cd " my-proj-path ";"))
     (setq my-proj-file (concat my-proj-path projectname ".org"))

     (loop for dir in org-project-manager-project-directories
	   do (make-directory (concat my-proj-path dir) t))
     (if (not (file-exists-p my-proj-file))
         (append-to-file org-project-manager-default-project-content nil my-proj-file)
       )
     (if (not (file-exists-p (concat my-proj-path ".git")))
	 ((lambda ()	   
	   (shell-command (concat my-proj-cd "git init"))      
	   (append-to-file org-project-manager-default-project-ignore nil (concat my-proj-path ".gitignore"))	   
	   (shell-command (concat my-proj-cd "git add *"))
	   ))
       )
     (message "Created new project: " my-proj-path)     	   
     )     
)

(defvar org-project-manager-default-category "Miscellaneous")
(defun org-project-manager-add-project (nickname)
  "Get parameters"
  (interactive ;;"DDirectory: 
   "sProject-name (short): ")
  (org-project-manager-parse-categories)
  
  (let* ((category (completing-read
		    "Choose a category: "
		    org-project-manager-project-categories nil nil nil nil org-project-manager-default-category)) loc directory)
    (save-excursion
      (set-buffer (find-file-noselect org-project-manager))
      (save-buffer)
      (goto-char (point-min))
      (re-search-forward (concat ":CATEGORY: " category))  
      (setq loc (org-entry-get nil "LOCATION" 'inherit))
      )  
    (setq directory (read-directory-name
		     "Choose location: "
		     loc
		     ))
    (let (org-capture-templates)
      (setq org-capture-templates
	    `(("p" "Project" plain (file+headline org-project-manager 
						  ,category)
	       ,(concat (make-string org-project-manager-project-level
				     (string-to-char "*"))
			" ACTIVE %c%?\n:PROPERTIES:\n:NICKNAME: %c\n:END:\n")
	       )))
      (org-project-manager-template directory nickname)
      (kill-new nickname)
      (org-capture nil "p")
      (pop kill-ring)
      )
    )
  )
#+END_SRC

**** TODO The capture approach
     
** Selecting projects
*** Categories

#+BEGIN_SRC emacs-lisp :export code
  (defvar org-project-manager-project-categories nil
"List of categories for sorting projects.")
#+END_SRC
    
#+BEGIN_SRC  emacs-lisp :export code
(defun org-project-manager-get-buffer-props (property)
    "Get a table of all values of PROPERTY used in the buffer, for completion."
    (let (props)
      (save-excursion
        (goto-char (point-min))
        (while (re-search-forward (concat ":" property ":") nil t)
          (add-to-list 'props (list
                               (org-entry-get
                                nil property nil)))))
      props))
  
(defun org-project-manager-parse-categories ()
    (interactive)
    (save-excursion
      (set-buffer (find-file-noselect org-project-manager))
      (setq org-project-manager-project-categories
            (reverse (org-project-manager-get-buffer-props "CATEGORY")))))
#+END_SRC

*** Agenda 
#+BEGIN_SRC emacs-lisp :export code
(defun org-project-manager-project-agenda ()
    "Show an agenda of all the projects. Useful, e.g. for toggling
the active status of projects."
    (interactive)
    (find-file org-project-manager)
    (push ?t unread-command-events)
    (push ?< unread-command-events)
    (call-interactively 'org-agenda))
(defun org-project-manager-project-orgfile-at-point ()
    "Construct the orgfile of project at point. Return nil if
  a) the point is not at a project
  b) the construction of the orgile failed (needs property PROJECTORG, or both LOCATION and NICKNAME)"
    (if (not (eq (nth 0 (org-heading-components)) org-project-manager-project-level))
        (error "No project at point.")
      (let* ((indexfile (org-entry-get nil "INDEX"))
             (orgfile (org-entry-get nil "PROJECTORG"))
             (pro (org-entry-get nil "NICKNAME"))
             (loc (org-entry-get nil "LOCATION" 'inherit)))
        (cond (indexfile
               (if (file-name-absolute-p indexfile)
                   indexfile
                 (expand-file-name (concat (file-name-as-directory loc) pro "/" indexfile))))
              (orgfile
               (if (file-name-absolute-p orgfile)
                   orgfile
                 (expand-file-name (concat (file-name-as-directory loc) pro "/" orgfile))))
              (t
               (expand-file-name (concat (file-name-as-directory loc) pro
                                         org-project-manager-org-location
                                         pro ".org")))))))
  
;;     (defun org-project-manager-agenda ()
;;      (interactive)
;;      (let ((org-agenda-files
;;             (delq nil (mapcar '(lambda (x) (let ((f (org-project-manager-get-org x))) (if (file-exists-p f) f))) 
;;                               (org-project-manager-parse-projects))))
;;            (org-agenda-include-diary nil))
;;            (org-agenda-list)))

#+END_SRC
#+BEGIN_SRC  emacs-lisp :export code
    (defun org-project-manager-goto-project-manager ()
      (interactive)
      (find-file org-project-manager))
#+END_SRC

*** Selecting project at point    
#+BEGIN_SRC emacs-lisp :export code
  (defun org-project-manager-project-at-point ()
    (interactive)
    (if (org-before-first-heading-p)
        (message "No project at point")
      (org-project-manager-project-orgfile-at-point)))
  
    (defun org-project-manager-return ()
      (interactive)
      (if (org-project-manager-project-at-point)
          (org-project-manager-visit-project)
        (org-return)))
    
    (defun org-project-manager-visit-project ()
      (interactive)
      ;; FIXME: ask user if buffer org-project-manager needs saving
      ;;        and/or parsing
      (when (org-project-manager-project-at-point)
        (find-file (org-project-manager-project-orgfile-at-point))))

#+END_SRC
