code/org-project-manager.el

(defun org-project-manager-format-project (entry)
  (let ((cat (org-project-manager-get entry "category"))
        (coll (org-project-manager-get entry "collab"))
        (nickname (car entry)))
    (cons
     ;; (format format cat (if coll coll "") nickname)
     (concat cat "/" (if coll (concat coll "/")) (car entry))
     (car entry))))

(defun org-project-manager-select-project ()
    (org-project-manager-parse-projects 'all)
    (let* ((project-array (mapcar 'org-project-manager-format-project org-project-manager-project-alist))
           ;; (pro (completing-read "Project: " org-project-manager-project-alist)))
           (completion-ignore-case t)
           ;; (key (completing-read "Project: " project-array))
           ;; (key (org-icompleting-read "Project: " project-array))
           (key (ido-completing-read "Project: " (mapcar 'car project-array)))
           (nickname (cdr (assoc key project-array))))
           (assoc nickname org-project-manager-project-alist)))
    
(defun org-project-manager-switch-to-project ()
  (interactive)
  (if (and org-project-manager-current-project
           (not (eq last-command 'org-project-manager-switch-to-project)))
      (let ((index (or
                    (org-project-manager-get-index org-project-manager-current-project)
                    (org-project-manager-get-org org-project-manager-current-project))))
        (find-file index)
        (message "Press the same key again to switch project"))
    (let ((pro (org-project-manager-select-project)))
      (setq org-project-manager-current-project pro)
      (find-file (org-project-manager-get-index org-project-manager-current-project)))))

(defun org-project-manager-get (project el)
  (cdr (assoc el (cadr project))))

(defun org-project-manager-get-index (project)
  (cdr (assoc "index-file" (cadr project))))

(defun org-project-manager-get-org (project)
  (cdr (assoc "org-file" (cadr project))))

(defun org-project-manager-get-location (project)
  (cdr (assoc "location" (cadr project))))

(defun org-project-manager-get-publish-directory (project)
  (cdr (assoc "publish-directory" (cadr project))))

(defun org-project-manager-get-category (project)
  (cdr (assoc "category" (cadr project))))

(defun org-project-manager-goto-project (&optional project heading create)
  (interactive)
  (let ((pro 
         (or project
            (car (org-project-manager-select-project)))))
    (when (and (not (string-equal pro "")) pro)
      (let* ((entry (assoc pro org-project-manager-project-alist))
        (loc (org-project-manager-get-location entry))
        (org (org-project-manager-get-org entry))
        (head (or heading "WorkFlow")))
      (if org
          (find-file org)
        (error "Project " pro " does not have an org-file."))
      (goto-char (point-min))
      (or (re-search-forward (concat "^[*]+ " heading) nil t)
          (when create
            (insert "* " heading "\n\n")
            (previous-line 1)))))))


(defun org-project-manager-goto-project-workflow ()
  (interactive)
  (or (org-project-manager-goto-project nil "WorkFlow" 'create)))

;; (org-project-manager-goto-project nil "WorkFlow" t)


(defun org-project-manager-goto-project-taskpool (&optional arg)
  (interactive)
  (if arg (org-store-link))
  (let* ((buf (current-buffer))
         (pro (completing-read "Select project: " org-project-manager-project-alist))
         (entry (assoc pro org-project-manager-project-alist))
         (loc (org-project-manager-get-location entry))
         (org (org-project-manager-get-org entry)))
    (if org
        (find-file org)
      (error "Project " pro " does not have an org-file."))
    (goto-char (point-min))
    (or (re-search-forward "^[*]+ TaskPool" nil t)
        (progn
          (goto-char (point-max))
          (insert "\n\n* TaskPool\n")
          (point)))))

(defvar org-project-manager-export-subdirectory "export")
(defvar org-project-manager-public-directory "~/public_html/")
;; (defvar org-project-manager-publish-subdirectory "public")
(require 'org-publish)
(defun org-project-manager-set-publish-alist ()
  (interactive)
  (let ((p-alist org-project-manager-project-alist))
    (while p-alist
      (let* ((entry  (car p-alist))
             (nickname (car entry))
             (base-directory (file-name-as-directory
                              (concat (file-name-as-directory
                                       (org-project-manager-get-location entry))
                                      nickname)))
             (export-directory
              (concat base-directory
                      org-project-manager-export-subdirectory))
             (public-directory
              (or (org-project-manager-get-publish-directory entry)
                  (concat (file-name-as-directory org-project-manager-public-directory)
                          nickname))))
        ;;(replace-regexp-in-string org-project-manager-public-directory (getenv "HOME") (expand-file-name export-directory))))
        (add-to-list 'org-publish-project-alist
                     `(,(concat nickname "-export")
                       :base-directory
                       ,base-directory
                       :base-extension "org"
                       :publishing-directory
                       ,base-directory
                       :headline-levels 4
                       :auto-preamble t
                       :recursive t
                       :publishing-function
                       org-publish-org-to-html))
        (add-to-list 'org-publish-project-alist
                     `(,(concat nickname "-copy")
                       :base-directory
                       ,export-directory
                       :base-extension
                       "html\\|png\\|jpg\\|org\\|pdf"
                       :publishing-directory
                       ,public-directory
                       :recursive t
                       :publishing-function
                       org-publish-attachment))
        (add-to-list 'org-publish-project-alist
                     `(,nickname
                       :components (,(concat nickname "-export") ,(concat nickname "-copy")))))
      (setq p-alist (cdr p-alist)))))

(provide 'org-project-manager)
